fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_УчетОтпусков</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	РасчетДнейОтпуска();

КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	РасчетДнейОтпуска();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	РасчетДнейОтпуска();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	РасчетДнейОтпуска();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)

	АдресВХранилище = ПоместитьВоВременноеХранилищеНаСервере();
	ПараметрыФормы = Новый Структура("АдресВХранилище", АдресВХранилище);
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПоместитьВоВременноеХранилищеНаСервере()

	Адрес = ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить( ,
		"Сотрудник,ДатаНачала,ДатаОкончания"), );
	Возврат Адрес;

КонецФункции

&НаКлиенте
Процедура РасчетДнейОтпуска()

	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
    	Строка.Более28 = ЛОЖЬ; 
	КонецЦикла;
	МассивСотрудников = ПолучитьСотрудниковСБолее28ДнейОтпуска();
	УстановитьПодсветкуСтрок(МассивСотрудников);

КонецПроцедуры

&НаСервере
Процедура УстановитьПодсветкуСтрок(МассивСотрудников)

	Если МассивСотрудников.Количество() > 0 Тогда
		Для Каждого Сотрудник Из МассивСотрудников Цикл
			
			МассивСтрок = Объект.ОтпускаСотрудников.НайтиСтроки(Новый Структура("Сотрудник", Сотрудник));
			Для Каждого Строка Из МассивСтрок Цикл
  				Строка.Более28 = Истина;
			КонецЦикла;

		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьСотрудниковСБолее28ДнейОтпуска()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ОтпускаСотрудников.Сотрудник КАК Сотрудник,
	|	ОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
	|	ОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТ_ДТ
	|ИЗ
	|	&ОтпускаСотрудников КАК ОтпускаСотрудников
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДТ.Сотрудник КАК Сотрудник,
	|	СУММА(РАЗНОСТЬДАТ(ВТ_ДТ.ДатаНачала, ВТ_ДТ.ДатаОкончания, ДЕНЬ) + 1) КАК КоличествоДней
	|ИЗ
	|	ВТ_ДТ КАК ВТ_ДТ
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДТ.Сотрудник";

	Запрос.УстановитьПараметр("ОтпускаСотрудников", Объект.ОтпускаСотрудников.Выгрузить());

	Результат= Запрос.Выполнить().Выбрать();

	МассивСотрудников = Новый Массив;

	Пока Результат.Следующий() Цикл

		Если Результат.КоличествоДней > 28 Тогда
			МассивСотрудников.Добавить(Результат.Сотрудник);
		КонецЕсли;

	КонецЦикла;

	Возврат МассивСотрудников;

КонецФункции

#КонецОбласти
